Environment: <AtariARIWrapper<TimeLimit<AtariEnv<PongDeterministic-v4>>>>
Number of trials: 3
Number of episodes: 600
Running times: []
init_learning_rate=2.5e-05
init_epsilon=0.5
epsilon_min=0.01
init_phi=0.5
phi_min=0.01
discount=0.99
sub_spaces=[]
model=Model: "model_9"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            (None, 32)           0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 12)           0                                            
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 512)          16896       input_6[0][0]                    
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 256)          3328        input_5[0][0]                    
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 256)          131328      dense_31[0][0]                   
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 128)          32896       dense_27[0][0]                   
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 128)          32896       dense_32[0][0]                   
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 64)           8256        dense_28[0][0]                   
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 64)           8256        dense_33[0][0]                   
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 32)           2080        dense_29[0][0]                   
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 32)           2080        dense_34[0][0]                   
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64)           0           dense_30[0][0]                   
                                                                 dense_35[0][0]                   
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 64)           4160        concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_37 (Dense)                (None, 32)           2080        dense_36[0][0]                   
__________________________________________________________________________________________________
dense_38 (Dense)                (None, 16)           528         dense_37[0][0]                   
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 6)            102         dense_38[0][0]                   
==================================================================================================
Total params: 244,886
Trainable params: 244,886
Non-trainable params: 0
__________________________________________________________________________________________________