Environment: <AtariARIWrapper<TimeLimit<AtariEnv<PongDeterministic-v4>>>>
Number of trials: 3
Number of episodes: 600
Running times: []
init_learning_rate=2.5e-05
init_epsilon=0.5
epsilon_min=0.01
init_phi=0.5
phi_min=0.01
discount=0.99
sub_spaces=[]
model=Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_19 (Dense)             (None, 512)               16896     
_________________________________________________________________
dense_20 (Dense)             (None, 256)               131328    
_________________________________________________________________
dense_21 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_22 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_23 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_24 (Dense)             (None, 64)                2112      
_________________________________________________________________
dense_25 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_26 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_27 (Dense)             (None, 6)                 102       
=================================================================
Total params: 196,278
Trainable params: 196,278
Non-trainable params: 0
_________________________________________________________________